a = {'연번': {19: 20}, '해수욕장명': {19: '진하'},
     '관리청': {19: '울주군'}, '시도 주소': {19: '울산광역시'},
     '시군구 주소': {19: '울주군'}, '읍면동 주소': {19: '서생면'},
     '이하 주소': {19: '진하리'}, '개장일': {19: '07-01'}, '폐장일': {19: '08-31'},
     '주요행사1': {19: '2019년 진하해수욕장 개장식(7.5)'}, '주요행사2': {19: '울산서머페스티벌(7월)'},
     '주요행사3': {19: '2019 진하해변축제(8월)'}, '주요행사4': {19: '-'}, '주요행사5': {19: '-'},
     '주요행사6': {19: '-'}, '주요행사7': {19: '-'}, '주요행사8': {19: '-'}, '홈페이지': {19: 'http://tour.ulju.ulsan.kr'},
     '연락처': {19: '052-204-0333'}}


# print(list(list(a.values()).pop().values()).pop())
result = {}
key = list(a['연번'])[0]

result['해수욕장명'] = a['해수욕장명'][key]
result['주소'] = a['시도 주소'][key] + " " + a['시군구 주소'][key] + " " + a['읍면동 주소'][key]
if a['이하 주소'][key] != "-":
    result['주소'] = result['주소'] + " " + a['이하 주소'][key]
result['개장일'] = a['개장일'][key]
result['폐장일'] = a['폐장일'][key]
result['주요행사'] = ""
for i in range(1,9):
    s = '주요행사'+str(i)
    if a[s][key] != "-":
        result['주요행사'] = result['주요행사'] + a[s][key] + ", "
    if i == 8:
        result['주요행사'] = result['주요행사'][:-2]
result['홈페이지'] = a['홈페이지'][key]
result['연락처'] = a['연락처'][key]
print(result)